In [1]:
import pandas as pd

In [2]:
import pandas as pd

df = pd.read_csv(r"C:\Users\user\Downloads\siddharth\loan_small.csv")

In [3]:
df.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y

In [4]:
df_sorted = df.sort_values(by = ['Area'])

In [5]:
df_sorted.head()

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y

In [6]:
len(df)

16

In [7]:
df_sorted = df_sorted.sort_values(by=['Area', 'ApplicantIncome'], ascending=[True, False])
df_sorted['running_sum'] = df_sorted.groupby('Area')['ApplicantIncome'].cumsum()

In [8]:
df_sorted

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status,running_sum
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y,4006.0
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y,6339.0
9,LP001020,Male,12841.0,10968.0,349.0,semi,N,12841.0
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y,18258.0
15,LP001032,Male,4950.0,0.0,125.0,semi,Y,23208.0
1,LP001003,Male,4583.0,NaN,128.0,semi,N,27791.0
7,LP001014,Female,3036.0,2504.0,158.0,semi,N,30827.0
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN,33410.0
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y,34709.0
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y,5849.0
10,LP001024,Female,3200.0,700.0,70.0,urban,Y,9049.0
11,LP001027,Male,2500.0,1840.0,109.0,urban,Y,11549.0
13,LP001029,Male,1853.0,2840.0,114.0,urban,N,13402.0
4,LP001008,Male,NaN,0.0,141.0,urban,Y,NaN
12,LP001028,Female,NaN,8106.0,NaN,urban,Y,NaN
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y,NaN

In [9]:
df_sorted['rank'] = df_sorted.groupby('Area')['ApplicantIncome'].rank(ascending=False, method='dense')

In [10]:
df_sorted

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status,running_sum,rank
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y,4006.0,1.0
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y,6339.0,2.0
9,LP001020,Male,12841.0,10968.0,349.0,semi,N,12841.0,1.0
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y,18258.0,2.0
15,LP001032,Male,4950.0,0.0,125.0,semi,Y,23208.0,3.0
1,LP001003,Male,4583.0,NaN,128.0,semi,N,27791.0,4.0
7,LP001014,Female,3036.0,2504.0,158.0,semi,N,30827.0,5.0
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN,33410.0,6.0
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y,34709.0,7.0
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y,5849.0,1.0
10,LP001024,Female,3200.0,700.0,70.0,urban,Y,9049.0,2.0
11,LP001027,Male,2500.0,1840.0,109.0,urban,Y,11549.0,3.0
13,LP001029,Male,1853.0,2840.0,114.0,urban,N,13402.0,4.0
4,LP001008,Male,NaN,0.0,141.0,urban,Y,NaN,NaN
12,LP001028,Female,NaN,8106.0,NaN,urban,Y,NaN,NaN
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y,NaN,NaN

1. Write a Python program to create a lambda function that adds 15 to a given number passed in as an argument, also create a lambda function that multiplies argument x with argument y and prints the result.

In [11]:
x =  int(input())
r = lambda z : z +15
print(x*r(x))

12
324

2. Write a Python program to create a function that takes one argument, and that argument will be multiplied with an unknown given number.

In [12]:
def multiplier(n):
    return lambda x: x * n

# Example usage:
unknown_multiplier = multiplier(5)  # The unknown number is 5

In [13]:
result = unknown_multiplier(10)  # 10 * 5 = 50
print(result)  # Output: 50

50

1. Sorting with Lambda
Given a list of tuples containing names and ages, sort the list in ascending order of age using a lambda function.

python
Copy
Edit
people = [("Alice", 25), ("Bob", 30), ("Charlie", 20), ("David", 35)]
Expected Output:

python
Copy
Edit
[('Charlie', 20), ('Alice', 25), ('Bob', 30), ('David', 35)]

In [14]:
people = [("Alice", 25), ("Bob", 30), ("Charlie", 20), ("David", 35)]
r = lambda x : sorted(x, key = lambda y : y[1])
r(people)

[('Charlie', 20), ('Alice', 25), ('Bob', 30), ('David', 35)]

2. Filtering Even Numbers
Use a lambda function inside filter() to extract all even numbers from the list.

python
Copy
Edit
numbers = [10, 15, 20, 25, 30, 35, 40]
Expected Output:

python
Copy
Edit
[10, 20, 30, 40]

In [15]:
numbers = [10, 15, 20, 25, 30, 35, 40]
even_numbers = list(filter(lambda x: x % 2 == 0, numbers))
print(even_numbers)
# filter(function, iterable)

[10, 20, 30, 40]

3. Squaring Numbers
Use map() with a lambda function to return a list of squares of the given numbers.

python
Copy
Edit
numbers = [2, 4, 6, 8, 10]
Expected Output:

python
Copy
Edit
[4, 16, 36, 64, 100]

In [16]:
numbers = [2, 4, 6, 8, 10]
x = list(map(lambda y : y**2,numbers))
print(x)

[4, 16, 36, 64, 100]

4. Multiplication of Corresponding Elements
Use map() and a lambda function to multiply elements of two lists index-wise.

python
Copy
Edit
list1 = [1, 2, 3, 4, 5]
list2 = [10, 20, 30, 40, 50]
Expected Output:

python
Copy
Edit
[10, 40, 90, 160, 250]

In [17]:
list1 = [1, 2, 3, 4, 5]
list2 = [10, 20, 30, 40, 50]
z = list(map(lambda x,y : x*y,list1,list2))
print(z)

[10, 40, 90, 160, 250]

5. Find Palindromes in a List
Use filter() and a lambda function to extract palindromic words from a list.

python
Copy
Edit
words = ["level", "hello", "radar", "world", "madam", "python"]
Expected Output:

python
Copy
Edit
['level', 'radar', 'madam']

In [18]:
words = ["level", "hello", "radar", "world", "madam", "python"]
z = list(filter(lambda x : x[::-1] == x ,words))
print(z)

['level', 'radar', 'madam']

6. Convert List of Strings to Uppercase
Use map() and a lambda function to convert a list of words to uppercase.

python
Copy
Edit
words = ["apple", "banana", "cherry"]
Expected Output:

python
Copy
Edit
['APPLE', 'BANANA', 'CHERRY']

In [19]:
words = ["apple", "banana", "cherry"]
z = list(map(lambda x : x.upper(),words))
print(z)

['APPLE', 'BANANA', 'CHERRY']

7. Find Maximum Using Reduce
Use functools.reduce() and a lambda function to find the maximum value in a list.

python
Copy
Edit
from functools import reduce
numbers = [3, 7, 2, 9, 5, 10, 1]
Expected Output:

python
Copy
Edit
10

In [20]:
from functools import reduce

numbers = [3, 7, 2, 9, 5, 10, 1]

# Using reduce() with lambda to find the maximum number
max_value = reduce(lambda x, y: x if x > y else y, numbers)

print(max_value)

10

1. Sorting List of Dictionaries by Multiple Keys
Given a list of dictionaries containing student names and their scores, use a lambda function to sort the list first by score in descending order, and in case of a tie, by name in ascending order.

python
Copy
Edit
students = [
    {"name": "Alice", "score": 85},
    {"name": "Bob", "score": 90},
    {"name": "Charlie", "score": 85},
    {"name": "David", "score": 92}
]
Expected Output:

python
Copy
Edit
[{'name': 'David', 'score': 92}, {'name': 'Bob', 'score': 90}, {'name': 'Alice', 'score': 85}, {'name': 'Charlie', 'score': 85}]

In [21]:
students = [
    {"name": "Alice", "score": 85},
    {"name": "Bob", "score": 90},
    {"name": "Charlie", "score": 85},
    {"name": "David", "score": 92}
]

In [22]:
sorted_students = sorted(students, key=lambda x: (-x["score"], x["name"]))
print(sorted_students)

[{'name': 'David', 'score': 92}, {'name': 'Bob', 'score': 90}, {'name': 'Alice', 'score': 85}, {'name': 'Charlie', 'score': 85}]

2. Removing Duplicates from a List Using set()
Use filter() and a lambda function to remove duplicates from a list while maintaining the original order of elements.

python
Copy
Edit
numbers = [1, 2, 3, 4, 4, 5, 2, 6, 3]
Expected Output:

python
Copy
Edit
[1, 2, 3, 4, 5, 6]

In [23]:
numbers = [1, 2, 3, 4, 4, 5, 2, 6, 3]
y = set(numbers)

In [24]:
z = list(y)

In [25]:
z

[1, 2, 3, 4, 5, 6]

In [26]:
seen = set()
unique_numbers = list(filter(lambda x: x not in seen and not seen.add(x), numbers))

In [27]:
unique_numbers

[1, 2, 3, 4, 5, 6]

3. Apply Multiple Operations with reduce()
Question:
Given a list of integers, use reduce() and a lambda function to calculate both the sum and product of the list elements.

python
Copy
Edit
numbers = [2, 3, 4]

In [28]:
from functools import reduce

numbers = [2, 3, 4]

# Calculate sum using reduce
sum_result = reduce(lambda x, y: x + y, numbers)

# Calculate product using reduce
product_result = reduce(lambda x, y: x * y, numbers)

print("Sum:", sum_result)
print("Product:", product_result)

Sum: 9
Product: 24

4. Find Palindromes Using filter() and lambda
Question:
Given a list of words, use filter() and a lambda function to find all the palindromes.

python
Copy
Edit
words = ["level", "hello", "radar", "world", "madam", "python"]

In [29]:
words = ["level", "hello", "radar", "world", "madam", "python"]
z = list(filter(lambda x :  x == x[::-1],words))

In [30]:
z

['level', 'radar', 'madam']

5. Find the Intersection of Two Lists Using filter() and lambda
Question:
Given two lists, use filter() and a lambda function to find the common elements (intersection).

python
Copy
Edit
list1 = [1, 2, 3, 4, 5]
list2 = [4, 5, 6, 7, 8]

In [31]:
list1 = [1, 2, 3, 4, 5]
list2 = [4, 5, 6, 7, 8]
z = list(filter( lambda x :x in list2, list1))

In [32]:
z

[4, 5]

6. Find the Longest Word in a List Using max() and lambda
Question:
Given a list of words, use max() and a lambda function to find the longest word.

python
Copy
Edit
words = ["apple", "banana", "cherry", "blueberry", "kiwi"]

In [33]:
words = ["apple", "banana", "cherry", "blueberry", "kiwi"]
longest_word = max(words, key=lambda word: len(word))

7. Sort a List of Dictionaries by a Key Using sorted() and lambda
Question:
Given a list of dictionaries containing students' names and scores, use sorted() and a lambda function to sort the list in descending order of scores.

python
Copy
Edit
students = [
    {"name": "Alice", "score": 85},
    {"name": "Bob", "score": 90},
    {"name": "Charlie", "score": 85},
    {"name": "David", "score": 92}
]

In [34]:
students = [
    {"name": "Alice", "score": 85},
    {"name": "Bob", "score": 90},
    {"name": "Charlie", "score": 85},
    {"name": "David", "score": 92}
]

sorted_students = sorted(students, key=lambda student: student["score"], reverse=True)

In [35]:
sorted_students

[{'name': 'David', 'score': 92},
 {'name': 'Bob', 'score': 90},
 {'name': 'Alice', 'score': 85},
 {'name': 'Charlie', 'score': 85}]

8. Find the Second Largest Number Using sorted() and lambda
Question:
Given a list of numbers, use sorted() and a lambda function to find the second largest number.

python
Copy
Edit
numbers = [10, 5, 8, 20, 15]

In [36]:
numbers = [10, 5, 8, 20, 15]
second_largest = sorted(numbers, key=lambda x: x, reverse=True)[1]

In [37]:
second_largest

15

9. Count Occurrences of Each Element Using reduce() and lambda
Question:
Given a list of numbers, use reduce() and a lambda function to count the occurrences of each element in the list.

python
Copy
Edit
numbers = [1, 2, 2, 3, 4, 4, 4, 5]

In [38]:
numbers = [1, 2, 2, 3, 4, 4, 4, 5]
occurrences = reduce(lambda acc, x: acc.update({x: acc.get(x, 0) + 1}) or acc, numbers, {})
occurrences

{1: 1, 2: 2, 3: 1, 4: 3, 5: 1}

10. Create a Dictionary from Two Lists Using zip() and lambda
Question:
Given two lists: one containing keys and the other containing values, use zip() and a lambda function to create a dictionary.

python
Copy
Edit
keys = ["name", "age", "city"]
values = ["Alice", 25, "New York"]

In [39]:
keys = ["name", "age", "city"]
values = ["Alice", 25, "New York"]

# Use zip() and lambda to create a dictionary
result_dict = dict(map(lambda kv: (kv[0], kv[1]), zip(keys, values)))

print(result_dict)

{'name': 'Alice', 'age': 25, 'city': 'New York'}